<?php


namespace DTK\extend;


/**
 * 异常信息
 * Class Error
 * @package DTK\extend
 */
class Error
{
    static $error = [
        "-100"  => "数据解析失败",
        "-1"    => "服务器错误",
        "1"     => "参数错误",
        "10000" => "淘宝商品id错误",
        "10001" => "开始时间或者结束时间不能为空",
        "10002" => "时间不在当天范围之内",
        "10003" => "分页参数错误，请合理调整请求大小最大值为请求1条数据信息",
        "10004" => "榜单类型为空或不正确",
        "10005" => "类目Id对应的类目不存在",
        "10006" => "未查询到对应信息",
        "10007" => "开始时间必须小于或等于结束时间",
        "10008" => "服务器繁忙请稍后再试",
        "10009" => "appKey异常",
        "10010" => "用户信息错误",
        "10011" => "转链失败",
        "10012" => "服务器内部错误",
        "10013" => "应用调用次数超限",
        "10014" => "应用调用频率过快",
        "10015" => "sign不能为空",
        "10016" => "appkey信息错误",
        "10017" => "版本号不能为空",
        "10018" => "appSecret异常",
        "10019" => "权限列表不可用",
        "10020" => "没有权限访问该服务",
        "10021" => "验证签名失败",
        "10022" => "请求频繁，请稍后再试",
        "10023" => "服务暂时没法访问，请稍后再试",
        "10024" => "请求地址不存在!",
        "10025" => "服务暂时没法访问，请稍后再试",
        "10026" => "转链失败",
        "10027" => "转链失败",
        "10028" => "转链失败",
        "10031" => "商品不存在",
        "10033" => "商品标题太短，停止转链",
        "10034" => "分类项不存在",
        "10035" => "数据异常",
        "10036" => "数据异常",
        "10037" => "转短链失败",
        "10038" => "访问该服务次数已达上限",
        "10039" => "请求参数错误",
        "10043" => "请填写pid及淘宝名称",
        "10044" => "不是合法的pid",
        "10048" => "pid信息错误",
        "10060" => "当前版本已过期",
        "10061" => "topic不能为空",
        "10201" => "当天访问该服务次数已达上限",
        "10202" => "当前分钟访问该服务次数已达上限",
    ];

}